[
  {
    "id": "1",
    "title": "Fed pauses rate cuts at 3.50%-3.75% as Trump nominates Kevin Warsh for Chair",
    "content": "The Fed held the FFR steady at 3.50%-3.75% on 28 January, pausing its easing cycle despite significant White House pressure. Chair Powell emphasised a 'wait-and-see' approach, citing resilient growth and sticky core PCE at 2.8%. The decision was followed by a surprise announcement on 30 January as President Trump nominated former Governor Kevin Warsh to succeed Powell in May. Markets reacted with extreme volatility; US equities fell on the news, while the DXY rallied toward 97.00. The move sparked a 'liquidity shock' in month-end trading, as Warsh is perceived as more hawkish than alternative candidates. Treasury yields rose as investors repriced the 2026 easing path, with markets now betting on fewer cuts than previously anticipated under the new leadership transition.",
    "date": "2026-01-28"
  },
  {
    "id": "2",
    "title": "Metals market collapse as Silver drops 30% and Gold falls below $5,000",
    "content": "Precious metals experienced a 'cascading liquidation event' on 30 January, with Silver plunging 30% from $115 to near $70 and Gold dropping below the psychological $5,000 support level. The sell-off was triggered by a combination of the surprise Warsh nomination, a surging USD, and aggressive month-end profit-taking following record highs in early 2026. While safe-haven demand had been bolstered by tensions in Iran and Venezuela earlier in the week, the sudden shift in US monetary expectations led to a massive unwinding of long positions. Industrial metals also faced pressure as World Bank reports projected a 7% decline in commodity prices for 2026 due to a growing oil surplus and slowing global demand. Analysts warned that failure to find immediate buyers could turn this into a deeper liquidity crisis.",
    "date": "2026-01-28"
  },
  {
    "id": "3",
    "title": "Global trade tensions escalate over Greenland and new European tariff threats",
    "content": "Global equity indices, particularly in Europe, faced heavy selling pressure after President Trump threatened new tariffs on European nations opposing US interests in Greenland. The CAC 40 and DAX fell by 1.4% and 1.6% respectively as trade uncertainty resurfaced. Concurrently, the IMF’s January WEO update revised 2026 global growth slightly up to 3.3% but warned that 'abrupt financial market corrections' remain a high risk, particularly in AI-linked sectors. In Asia, the KOSPI and TAIEX hit record highs on AI demand, but Japanese equities struggled as 40-year JGB yields saw historic spikes amid fiscal concerns and electoral uncertainty. The divergence between buoyant AI-driven tech sentiment and deteriorating trade relations continues to drive cross-asset volatility, with the US-China export battle weighing on German manufacturing growth.",
    "date": "2026-01-28"
  }
]
