[
  {
    "id": "1",
    "title": "FX markets jittery as yen spikes on intervention speculation",
    "content": "The Japanese yen surged sharply against the USD, triggering speculation that authorities might intervene to support the currency after prolonged weakness. FX markets opened the week on edge, with traders anticipating possible official buying to halt the yen’s slide after it rebounded from multi-month lows. Japanese PM Sanae Takaichi vowed to act against abnormal market moves, and the New York Fed’s rate check raised intervention expectations. Volatility in the yen has broader implications for equity and bond markets as risk sentiment adjusts to currency stress and potential policy responses. Markets remain sensitive to intervention cues amid thin liquidity."
  },
  {
    "id": "2",
    "title": "Central banks diverge: Canada holds rates, Brazil set to cut",
    "content": "Major central banks signalled contrasting policy paths this week. A Reuters poll showed the Bank of Canada is likely to keep its policy rate on hold throughout 2026 amid steady growth and contained inflation expectations. Conversely, economists expect Brazil’s central bank to begin cutting interest rates in March to stimulate a weakening economy, marking the first reduction in almost two years. These divergent monetary stances underscore differing economic conditions across regions and are influencing global yield curves, currencies and EM capital flows as markets price adjustment cycles."
  },
  {
    "id": "3",
    "title": "RBI commits record liquidity injection amid volatility",
    "content": "The Reserve Bank of India announced plans to inject over $23 billion into the banking system via bond purchases, FX swaps and repos to reinforce recent rate cuts and counter liquidity strains from currency interventions. The multi-tranche liquidity push – including a record volume of government bond purchases – aims to align system liquidity with RBI targets as yields and rupee volatility rise. This significant central bank action has implications for EM debt markets and signals a proactive approach to financial stability amid global volatility."
  }
]

